# SetJustification Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColumnAttachment..::..SetJustification Method
ColumnAttachment Class See Also
---
Setter of ColumnAttachmentJustification
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetJustification(
	ColumnAttachmentJustification justification
)
```

Visual Basic
---
```text
Public Sub SetJustification ( _
	justification As ColumnAttachmentJustification _
)
```

Visual C++
---
```text
public:
void SetJustification(
	ColumnAttachmentJustification justification
)
```

# ### Parameters
justification
    Type: Autodesk.Revit.DB..::..ColumnAttachmentJustification
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ColumnAttachment Class
Autodesk.Revit.DB Namespace